[
  {
    "company": "Mozilla",
    "companySite": "https://foundation.mozilla.org/en/",
    "logo": "/img/mozilla.png",
    "startDate": "June 2021",
    "endDate": "Present",
    "title": "Front End Developer",
    "description": "Full-time position. Joined the Digital Engagement team to help create digital experiences that connect with users on their journey through our web properties. The Digital Engagement team is primarily focused on reaching a wide audience to build a grassroots movement of activists working to improve the open internet.",
    "details": [
      "Formalizing our Figma design system in code with JavaScript and React components",
      "Adding new templates and content types to the Foundation's CMS",
      "Collaborating with the design team to implement UX/UI improvements"
    ]
  },
  {
    "company": "Beamdog",
    "companySite": "https://www.beamdog.com/",
    "logo": "/img/beamdog.jpg",
    "startDate": "Sept 2018",
    "endDate": "June 2021",
    "title": "Web Developer/Game Developer",
    "description": "Full-time position. Participated in the full development lifecycle on the web-based game, “Axis & Allies 1942 Online”",
    "details": [
      "Use web technology like Sass, Typescript and React to create UI components for online video game",
      "Implement mockups and wireframes from designers to recreate common game views like main menus and player profiles",
      "Automate iOS builds using Fastlane and Github Actions",
      "Updating Confluence  documentation for existing codebase"
    ]
  },
  {
    "company": "TeachMe",
    "companySite": "https://www.teachme.com/",
    "logo": "/img/teach.jpg",
    "startDate": "Feb 2018",
    "endDate": "Aug 2018",
    "title": "Web Developer",
    "description": "A full-time position that provides software development for online educational games",
    "details": [
      "Collaborated with backend developers to add membership features including report cards and subscription landing pages",
      "Created mockups using Figma/Adobe Illustrator for rapid prototyping"
    ]
  },
  {
    "company": "Iomer Internet Solutions",
    "companySite": "https://www.iomer.com",
    "logo": "/img/iomer.png",
    "startDate": "Sept 2016",
    "endDate": "Feb 2018",
    "title": "Junior Consultant,Solution Developer",
    "description": "Full-time position that provides software development based primarily on the Microsoft platform to multiple clients.",
    "details": [
      "Collaborate with clients and other team members to plan and conduct large websites and intranets",
      "Support solution architecture at both enterprise and project levels using Sharepoint and ASP.Net projects",
      "Collaborate with designers and project managers to create front-end solutions and branding using Sass and Javascript Libraries (React, AngularJS, Jquery)"
    ]
  },
  {
    "company": "University of Alberta/Fouad Lab",
    "companySite": "http://www.rehabresearch.ualberta.ca/karimfouad/",
    "logo": "/img/uofa.png",
    "startDate": "April 2016",
    "endDate": "Sept 2016",
    "title": "Programmer",
    "description": "Temporary Position developing desktop applications to aid a postdoctoral researcher experiments.",
    "details": [
      "Developing a single page application that can be ported to a desktop application using Electron and Knockout JS",
      "Develop User-friendly Software that can handle thousands of scientific records within multiple experiments",
      "Creating an offline application that can parse and store the raw data from generated text files"
    ]
  },
  {
    "company": "Four Winds & Associates Inc.",
    "companySite": "http://www.fourwinds.ca/",
    "logo": "/img/four.png",
    "startDate": "June 2015",
    "endDate": "Nov 2016",
    "title": "Junior Web Developer",
    "description": "Part-time position that consists of coding at all levels of the application stack - database and SQL, application servers in python and django, and the front-end in HTML, CSS, and jQuery.",
    "details": [
      "Modify existing Django applications based of clients requests and deploy them on Digitalocean Droplets"
    ]
  },
  {
    "company": "Playmaker Inc.",
    "companySite": "https://simon-fessehaye.netlify.app/resume/",
    "startDate": "June 2015",
    "endDate": "Oct 2015",
    "title": "Junior Web Programmer",
    "description": "Part-time position that consists of coding at all levels of the application stack - database and SQL, application servers in python and django, and the front-end in HTML, CSS, and jQuery.",
    "details": [
      "Worked on REST API and functionality to Symfony framework application",
      "Used PHP Websockets and front-end Javascript to create simple chat application"
    ]
  },
  {
    "company": "University Of Alberta/Faculty of Business",
    "companySite": "https://www.ualberta.ca/index.html",
    "logo": "/img/uofa.png",
    "startDate": "Nov 2014",
    "endDate": "Apr 2015",
    "title": "Internet Design and Programming Assistant",
    "description": "Worked part-time remotely using django and python to create a web application to support web-scapping scripts.",
    "details": [
      "Recreate existing NodeJS project as a Python Django web application",
      "Create Django applications for large-scale research project"
    ]
  },
  {
    "company": "University of Alberta/Technical Support Team",
    "companySite": "https://uofa.ualberta.ca/computing-science/links-and-resources/technical-support",
    "logo": "/img/uofa.png",
    "startDate": "May 2013",
    "endDate": "July 2014",
    "title": "Helpdesk Consultant",
    "description": "Worked in the CS Helpdesk year-round helping students and staff with IT related issues.",
    "details": [
      "Troubleshooting undergraduate/graduate student accounts using various techniques",
      "Using scripting languages to represent data from specific machines",
      "Using linux scripts/commands to obtain information about specific machines as well as sshing remotely to servers within the Computing Science department"
    ]
  }
]