[
  {
    "company": "Vivante Health",
    "companySite": "https://vivantehealth.com/",
    "logo": "https://vivantehealth.com/wp-content/uploads/2020/03/logo_150.png",
    "startDate": "April 2024",
    "endDate": "Present",
    "title": "Senior Software Engineer",
    "description": "",
    "details": []
  },
  {
    "company": "UrbanLogiq",
    "companySite": "https://urbanlogiq.com/",
    "logo": "https://pbs.twimg.com/profile_images/1033822284098588672/DDIBaP-w_400x400.jpg",
    "startDate": "July 2023",
    "endDate": "April 2024",
    "title": "Senior Software Engineer",
    "description": "Full-time position, worked on the web development team to contribute towards data visualization reports for multiple governments across North America.",
    "details": [
      "Implemented efficient URL routing in the frontend, resulting in more accurate Sentry error reports and a subsequent improvement in overall system stability and user experience.",
      "Led and facilitated key sprint rituals, including retrospectives and sprint planning, guiding our team of 6 developers through structured sessions that fostered open communication and collaboration. This proactive approach contributed to improved team cohesion.",
      "Spearheaded the integration of developer-centric tools such as Tailwind CSS and Playwright(end-to-end testing), revolutionizing our development workflow."
    ]
  },
  {
    "company": "Mozilla",
    "companySite": "https://foundation.mozilla.org/en/",
    "logo": "/img/mozilla.png",
    "startDate": "June 2021",
    "endDate": "March 2023",
    "title": "Front End Developer",
    "description": "Temporary Full-time position. Joined the Digital Engagement team to help create digital experiences that connect with users on their journey through our web properties. The Digital Engagement team is primarily focused on reaching a wide audience to build a grassroots movement of activists working to improve the open internet.",
    "details": [
      "Championed the code implementation of the team's Figma design system with JavaScript and React components, resulting in a more streamlined and efficient design process.",
      "Optimized the Foundation's CMS by adding new templates and content types; facilitated content creation by Mozilla's team of content writers and reduced manual site updates by developers.",
      "Implemented internal tools to streamline development workflows and increase efficiency.",
      "Spearheaded the planning and implementation of front-end features for Mozilla's Privacy Not Included site, including client-side routing, state management, and interactive animations."
    ]
  },
  {
    "company": "Beamdog",
    "companySite": "https://www.beamdog.com/",
    "logo": "/img/beamdog.jpg",
    "startDate": "Sept 2018",
    "endDate": "June 2021",
    "title": "Web Developer/Game Developer",
    "description": "Full-time position. Participated in the full development lifecycle on the web-based game, “Axis & Allies 1942 Online”",
    "details": [
      "Developed UI components for \"Axis & Allies 1942 Online\" using Sass, TypeScript, and React.",
      "Transformed designer mockups and wireframes into user-friendly interfaces, such as system menus and user profiles, resulting in a seamless user experience and positive feedback from clients.",
      "Automated iOS builds using Fastlane and GitHub Actions to improve development efficiency.",
      "Reorganized React components to better align with industry standards and best practices, resulting in more approachable and intuitive code."
    ]
  },
  {
    "company": "TeachMe",
    "companySite": "https://www.teachme.com/",
    "logo": "/img/teach.jpg",
    "startDate": "Feb 2018",
    "endDate": "Aug 2018",
    "title": "Web Developer",
    "description": "A full-time position that provides software development for online educational games",
    "details": [
      "Collaborated with the back-end team to add subscription-exclusive features for mathgames.com including personalized dashboards and landing pages, increasing the site's revenue.",
      "Created mockups using Figma and Adobe Illustrator for rapid prototyping."
    ]
  },
  {
    "company": "Iomer Internet Solutions",
    "companySite": "https://www.iomer.com",
    "logo": "/img/iomer.png",
    "startDate": "Sept 2016",
    "endDate": "Feb 2018",
    "title": "Junior Consultant,Solution Developer",
    "description": "Full-time position that provides software development based primarily on the Microsoft platform to multiple clients.",
    "details": [
      "Collaborated with designers and project managers to create front-end solutions and branding using Sass and Javascript Libraries (React, AngularJS).",
      "Support solution architecture at both enterprise and project levels using Sharepoint and ASP.Net projects",
      "Contributed with the development of websites and intranets for major clients such as Alberta's Liquor Connect, Alberta Motor Association, and Cashco Financial, driving successful outcomes and ensuring client satisfaction."
    ]
  },
  {
    "company": "University of Alberta/Fouad Lab",
    "companySite": "http://www.rehabresearch.ualberta.ca/karimfouad/",
    "logo": "/img/uofa.png",
    "startDate": "April 2016",
    "endDate": "Sept 2016",
    "title": "Programmer",
    "description": "Temporary Position developing desktop applications to aid a postdoctoral researcher experiments.",
    "details": [
      "Developed a single-page application ported as a desktop application using Electron and Knockout JS to aid postdoctoral researchers' experiments.",
      "Implemented offline friendly features to parse and store data to save researcher's time when collecting their data.",
      "Creating an offline application that can parse and store the raw data from generated text files"
    ]
  },
  {
    "company": "Four Winds & Associates Inc.",
    "companySite": "http://www.fourwinds.ca/",
    "logo": "/img/four.png",
    "startDate": "June 2015",
    "endDate": "Nov 2016",
    "title": "Junior Web Developer",
    "description": "Part-time position that consists of coding at all levels of the application stack - database and SQL, application servers in python and django, and the front-end in HTML, CSS, and jQuery.",
    "details": [
      "Modify existing Django applications based of clients requests and deploy them on Digitalocean Droplets"
    ]
  },
  {
    "company": "Playmaker Inc.",
    "companySite": "https://simon-fessehaye.netlify.app/resume/",
    "startDate": "June 2015",
    "endDate": "Oct 2015",
    "title": "Junior Web Programmer",
    "description": "Part-time position that consists of coding at all levels of the application stack - database and SQL, application servers in python and django, and the front-end in HTML, CSS, and jQuery.",
    "details": [
      "Worked on REST API and functionality to Symfony framework application",
      "Used PHP Websockets and front-end Javascript to create simple chat application"
    ]
  },
  {
    "company": "University Of Alberta/Faculty of Business",
    "companySite": "https://www.ualberta.ca/index.html",
    "logo": "/img/uofa.png",
    "startDate": "Nov 2014",
    "endDate": "Apr 2015",
    "title": "Internet Design and Programming Assistant",
    "description": "Worked part-time remotely using django and python to create a web application to support web-scapping scripts.",
    "details": [
      "Recreate existing NodeJS project as a Python Django web application",
      "Create Django applications for large-scale research project"
    ]
  },
  {
    "company": "University of Alberta/Technical Support Team",
    "companySite": "https://uofa.ualberta.ca/computing-science/links-and-resources/technical-support",
    "logo": "/img/uofa.png",
    "startDate": "May 2013",
    "endDate": "July 2014",
    "title": "Helpdesk Consultant",
    "description": "Worked in the CS Helpdesk year-round helping students and staff with IT related issues.",
    "details": [
      "Troubleshooting undergraduate/graduate student accounts using various techniques",
      "Using scripting languages to represent data from specific machines",
      "Using linux scripts/commands to obtain information about specific machines as well as sshing remotely to servers within the Computing Science department"
    ]
  }
]